In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [3]:
username = "privateuser"
password = "***********"
port = 7777
database = "Shutterfly"

engine = create_engine('mysql+mysqldb://%s:%s@localhost:%i/%s'
                       %(username, password, port, database))

In [4]:
df_online = pd.read_csv("data/online.csv")
df_online.head()

   session  visitor                   dt  custno  category  event1  event2
0   419542   140970  2016-09-16 05:03:23    3840         1     NaN       1
1  3030130    14501  2017-11-13 04:58:12   70400         1     NaN       1
2  2638740   419353  2017-05-24 16:10:38   21248         1     NaN       1
3   880408    90673  2017-10-28 13:42:38   39168         1     NaN       1
4  2612179   191542  2016-05-17 06:30:32   47616         1     NaN       1

In [5]:
df_online.to_sql('Online', engine, if_exists='replace')

In [6]:
df_order = pd.read_csv("data/Order.csv")
df_order.head()

   custno   ordno            orderdate  prodcat2  prodcat1  revenue
0   18944   64694  2016-11-27 20:57:20       NaN         1    53.30
1   18944  114405  2017-04-29 20:18:04       NaN         1     0.10
2   18944   28906  2017-04-23 21:31:03       NaN         1   141.66
3   36096   62681  2016-02-25 07:16:33       NaN         1    36.82
4       1       1  2017-06-12 08:27:59       NaN         1     8.35

In [8]:
df_order.to_sql('Purchase', engine, if_exists='replace')